<!--
 * @Author: Wanko
 * @Date: 2024-04-01 16:10:48
 * @LastEditors: Wanko
 * @LastEditTime: 2024-04-01 17:14:42
 * @Description: 
-->
<template>
  <div class="p">
    <c-section title="基本使用" customClass="my"/>
    <c-read-more>
      <div>
        {{ content }}
      </div>
    </c-read-more>
    <c-section title="不要阴影" customClass="my"/>
    <c-read-more :shadow="false">
      <div>
        {{ content }}
      </div>
    </c-read-more>
    <c-section title="自定义颜色文字" customClass="my"/>
    <c-read-more closeText="我要展开" openText="我要关闭" color="blue" size="20">
      <div>
        {{ content }}
      </div>
    </c-read-more>
  </div>
</template>

<script>
export default {
  data() {
    return {
      // 这是一段很长的文字，也可能包含有HTML标签等内容
      content: `山不在高，有仙则名。水不在深，有龙则灵。斯是陋室，惟吾德馨。
				苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。可以调素琴，阅金经。
				无丝竹之乱耳，无案牍之劳形。南阳诸葛庐，西蜀子云亭。孔子云：何陋之有？山不在高，有仙则名。水不在深，有龙则灵。斯是陋室，惟吾德馨。
				苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。可以调素琴，阅金经。
				无丝竹之乱耳，无案牍之劳形。南阳诸葛庐，西蜀子云亭。孔子云：何陋之有？山不在高，有仙则名。水不在深，有龙则灵。斯是陋室，惟吾德馨。
				苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。可以调素琴，阅金经。
				无丝竹之乱耳，无案牍之劳形。南阳诸葛庐，西蜀子云亭。孔子云：何陋之有？山不在高，有仙则名。水不在深，有龙则灵。斯是陋室，惟吾德馨。
				苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。可以调素琴，阅金经。
				无丝竹之乱耳，无案牍之劳形。南阳诸葛庐，西蜀子云亭。孔子云：何陋之有？山不在高，有仙则名。水不在深，有龙则灵。斯是陋室，惟吾德馨。
				苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。可以调素琴，阅金经。
				无丝竹之乱耳，无案牍之劳形。南阳诸葛庐，西蜀子云亭。孔子云：何陋之有？山不在高，有仙则名。水不在深，有龙则灵。斯是陋室，惟吾德馨。
				苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。可以调素琴，阅金经。
				无丝竹之乱耳，无案牍之劳形。南阳诸葛庐，西蜀子云亭。孔子云：何陋之有？`
    }
  }
}
</script>
